const datasym = 0;
const dataval = 1;

const t1 = '\u0304';
const t2 = '\u0301';
const t3 = '\u0306';
const t4 = '\u0300';

var data = [
  ["你","ni$t3"],
  ["好", "ha${t3}o"],
  ["吗", "ma"],
  ["我", "wo$t3"],
  ["很", "he${t3}n"],
  ["呢", "ne"],
  ["也", "ye$t3"],
  ["忙", "ma${t2}ng"],
  ["不", "bu4"],
  ["哥哥", "ge${t1}ge${t1}"],
  ["第第", "di${t4}di${t4}"],
  ["们", "men"],
  ["都", "do${t1}u"],
  ["他", "ta$t1"],
  ["这", "zhe${t4}"],
  ["是", "shi${t4}"],
  ["爸爸", "ba${t4}ba${t4}"],
  ["妈妈", "ma${t1}ma${t1}"],
  ["朋友", "pe${t2}ngyou"],
  ["大夫", "da${t4}ifu"],
  ["的", "de"],
  ["车", "che${t1}"],
  ["那", "na${t4}"],
  ["她", "ta${t1}'"],
  ["书", "shu${t1}"]
];
//
// ["", ""],